RailsProject/app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors"
---
  def index
    @authors = Author.all

SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 4]]
---
  def show_all_books
      @books = Book.where(author_id: params[:id])

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_author
      @author = Author.find(params[:id])